tutorials/reactiveTransport/reactiveTransportDBSFoam/3DcalcitePost/constant/dynamicMeshDict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2106                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "constant";
    object      dynamicMeshDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dynamicFvMesh   dynamicRefineFvMesh;
refineInterval  200;
field           eps;
lowerRefineLevel 0.01;
upperRefineLevel 0.99;
unrefineLevel   1.01;
nBufferLayers   1;
maxRefinement   1;
maxCells        20000000;
correctFluxes
(
    (
        phi
        U
    )
);
dumpLevel       true;


// ************************************************************************* //
