tutorials/reactiveTransport/reactiveTransportDBSFoam/3DcalcitePost/0_orig/C
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2106                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    location    "0";
    object      C;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 -3 0 0 1 0 0];

internalField   uniform 0; 

boundaryField
{
    outlet 
    {
        type            zeroGradient;
    }
    inlet 
    {
        type            fixedValue;
        value           uniform c_inlet;
    }
    walls 
    {
        type            zeroGradient;
    }
}


// ************************************************************************* //
